#include<stdio.h>
int main()
{
    int x,y,m,n;
    scanf("%d%d%d%d",&x,&y,&m,&n);
    int a[21][21];     //因为A在（0,0）,B极限可取（20，20），所以最小空间为21*21
    for(int i=0; i<=x; i++)
    {
        for(int j=0; j<=y; j++)
        {
            a[i][j]=1;
        }
    }
    a[m][n]=0;            //a数组拿来判断此点是否会被马拦住，0表示不行即会被拦住，1表示不会被拦住
    int m1=m-2;
    int m2=m-1;
    int m3=m+1;
    int m4=m+2;
    int n1=n-2;
    int n2=n-1;
    int n3=n+1;
    int n4=n+2;
    if(m1>=0&&n2>=0) a[m1][n2]=0;   //八个判断语句判断马能走的地方在不在定义的范围内，若在则要变0
    if(m1>=0&&n3<=y) a[m1][n3]=0;
    if(m2>=0&&n1>=0) a[m2][n1]=0;
    if(m2>=0&&n4<=y) a[m2][n4]=0;
    if(m3<=x&&n1>=0) a[m3][n1]=0;
    if(m3<=x&&n4<=y) a[m3][n4]=0;
    if(m4<=x&&n2>=0) a[m4][n2]=0;
    if(m4<=x&&n3<=y) a[m4][n3]=0;
    double b[21][21];     //后续走法会有很多种，会超int范围，所以定义double类型
    for(int i=0; i<=x; i++)
    {
        for(int j=0; j<=y; j++)
        {
            b[i][j]=0;    //初始化每一点的走法为0中
        }
    }
    b[0][0]=1;     //起点到起点的走法为一种
    for(int i=0; i<=x; i++)      //类似递归的走法，一点一点来直到到达B点
    {
        for(int j=0; j<=y; j++)
        {
            if(a[i][j]==0) b[i][j]=0;   //如果该点会被马拦，则该点走法为0种
            else
            {
                if(i>0) b[i][j]+=b[i-1][j];  //还没达到左边界，此点的左边的那个点可以往右走到该点，所以该点的走法应加上左边那点的走法
                if(j>0) b[i][j]+=b[i][j-1];  //还没达到上边界，此点的上边的那个点可以往下走到该点，所以该点的走法应加上上边那点的走法
            }
        }
    }
    printf("%.0f",b[x][y]);   //输出格式为整数
}
